Repository: amirmohamada017/meeta-backend
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fa

source: Phone number is required
fa: شماره تلفن الزامی است

source: Superuser must have is_staff=True
fa: کاربر ارشد باید is_staff=True داشته باشد

source: Superuser must have is_superuser=True
fa: کاربر ارشد باید is_superuser=True داشته باشد

source: User
fa: کاربر

source: OTP
fa: رمز یکبار مصرف

source: OTPs
fa: رمزهای یکبار مصرف

source: Phone number must be exactly 11 digits
fa: شماره تلفن باید دقیقاً ۱۱ رقم باشد

source: OTP code is required
fa: کد یکبار مصرف الزامی است

source: OTP code must be exactly 4 digits
fa: کد یکبار مصرف باید دقیقاً ۴ رقم باشد

source: Signup token is required
fa: توکن ثبت‌نام الزامی است

source: First name cannot be empty
fa: نام نمی‌تواند خالی باشد

source: Last name cannot be empty
fa: نام خانوادگی نمی‌تواند خالی باشد

source: Phone number must be 11 digits starting with 09
fa: شماره تلفن باید ۱۱ رقم و با ۰۹ شروع شود

source: Too many OTP requests. Please try again later
fa: درخواست‌های زیاد برای دریافت کد. لطفاً بعداً تلاش کنید

source: OTP send failed
fa: ارسال کد یکبار مصرف ناموفق بود

source: Failed to send OTP. Please try again later
fa: ارسال کد یکبار مصرف ناموفق بود. لطفاً بعداً تلاش کنید

source: Signup token validation failed
fa: اعتبارسنجی توکن ثبت‌نام ناموفق بود

source: SMS configuration error detected
fa: خطای پیکربندی پیامک شناسایی شد

source: SMSIR_API_KEY is not configured in settings
fa: SMSIR_API_KEY در تنظیمات پیکربندی نشده است

source: SMSIR_TEMPLATE_ID is not configured in settings
fa: SMSIR_TEMPLATE_ID در تنظیمات پیکربندی نشده است

source: SMSIR_TEMPLATE_ID must be a valid integer
fa: SMSIR_TEMPLATE_ID باید یک عدد صحیح معتبر باشد

source: SMSIR_BASE_URL is not configured in settings
fa: SMSIR_BASE_URL در تنظیمات پیکربندی نشده است

source: SMS provider returned an error
fa: سرویس پیامک خطا برگرداند

source: SMS provider error: {error}
fa: خطای سرویس پیامک: {error}

source: SMS provider timeout occurred
fa: زمان انتظار سرویس پیامک به پایان رسید

source: SMS service timeout
fa: زمان انتظار سرویس پیامک به پایان رسید

source: SMS provider connection error occurred
fa: خطای اتصال به سرویس پیامک رخ داد

source: SMS service connection error
fa: خطای اتصال به سرویس پیامک

source: Unexpected error occurred during SMS send
fa: خطای غیرمنتظره در ارسال پیامک رخ داد

source: Unexpected SMS error: {error}
fa: خطای غیرمنتظره پیامک: {error}

source: OTP code must be a string
fa: کد یکبار مصرف باید متن باشد

source: OTP code must contain only digits
fa: کد یکبار مصرف فقط باید شامل اعداد باشد

source: OTP code must be exactly {OTP_CODE_LENGTH} digits
fa: کد یکبار مصرف باید دقیقاً {OTP_CODE_LENGTH} رقم باشد

source: First name must be a string
fa: نام باید متن باشد

source: First name must be at least 2 characters long
fa: نام باید حداقل ۲ کاراکتر باشد

source: First name cannot exceed 150 characters
fa: نام نمی‌تواند بیشتر از ۱۵۰ کاراکتر باشد

source: Last name must be a string
fa: نام خانوادگی باید متن باشد

source: Last name must be at least 2 characters long
fa: نام خانوادگی باید حداقل ۲ کاراکتر باشد

source: Last name cannot exceed 150 characters
fa: نام خانوادگی نمی‌تواند بیشتر از ۱۵۰ کاراکتر باشد

source: OTP sent successfully
fa: کد یکبار مصرف با موفقیت ارسال شد

source: OTP verification failed
fa: تأیید کد یکبار مصرف ناموفق بود

source: Invalid or Expired OTP code
fa: کد یکبار مصرف نامعتبر یا منقضی شده است

source: OTP verified successfully
fa: کد یکبار مصرف با موفقیت تأیید شد

source: Invalid or expired signup token
fa: توکن ثبت‌نام نامعتبر یا منقضی شده است

source: User with this phone number already exists
fa: کاربری با این شماره تلفن از قبل وجود دارد

source: User signup failed
fa: ثبت‌نام کاربر ناموفق بود

source: Failed to create user account
fa: ایجاد حساب کاربری ناموفق بود

source: Refresh token not found
fa: توکن بازنشانی یافت نشد

source: Invalid or Expired authentication token
fa: توکن احراز هویت نامعتبر یا منقضی شده است

source: Token refresh failed
fa: بازنشانی توکن ناموفق بود

source: Logout attempted but blacklist failed
fa: تلاش برای خروج انجام شد اما لیست سیاه ناموفق بود

source: This username is already taken.
fa: این نام کاربری قبلاً استفاده شده است.

source: You cannot add more than {Profile.MAX_INTERESTS} interests.
fa: شما نمی‌توانید بیشتر از {Profile.MAX_INTERESTS} علاقه‌مندی اضافه کنید.

source: Some interests do not exist.
fa: برخی از علاقه‌مندی‌ها وجود ندارند.

source: Image file size cannot exceed {max_size}MB. Current size: {current_size}MB
fa: حجم فایل تصویر نمی‌تواند بیشتر از {max_size} مگابایت باشد. حجم فعلی: {current_size} مگابایت

source: Invalid image format. Allowed formats: {formats}
fa: فرمت تصویر نامعتبر است. فرمت‌های مجاز: {formats}

source: Image validation failed
fa: اعتبارسنجی تصویر ناموفق بود

source: Invalid image file: {error}
fa: فایل تصویر نامعتبر است: {error}

source: Image processing failed
fa: پردازش تصویر ناموفق بود

source: Profile created for new user
fa: پروفایل برای کاربر جدید ایجاد شد

source: Profile creation failed during user signup
fa: ایجاد پروفایل در طول ثبت‌نام کاربر ناموفق بود

source: Failed to delete profile picture file during profile deletion
fa: حذف فایل تصویر پروفایل در طول حذف پروفایل ناموفق بود

source: Username must be at least 3 characters long.
fa: نام کاربری باید حداقل ۳ کاراکتر باشد.

source: Username cannot exceed 32 characters.
fa: نام کاربری نمی‌تواند بیشتر از ۳۲ کاراکتر باشد.

source: Username can only contain letters, numbers, and hyphens. Must be 3-32 characters, start with a letter, no double hyphens, no trailing hyphen.
fa: نام کاربری فقط می‌تواند شامل حروف، اعداد و خط تیره باشد. باید ۳ تا ۳۲ کاراکتر باشد، با حرف شروع شود، بدون خط تیره دوبل و بدون خط تیره در انتها.

source: Username cannot start with a number.
fa: نام کاربری نمی‌تواند با عدد شروع شود.

source: This username is reserved and cannot be used.
fa: این نام کاربری رزرو شده و قابل استفاده نیست.

source: Please provide a valid Instagram URL.
fa: لطفاً یک آدرس اینستاگرام معتبر وارد کنید.

source: Please provide a valid LinkedIn URL.
fa: لطفاً یک آدرس لینکدین معتبر وارد کنید.

source: You cannot have more than {Profile.MAX_INTERESTS} interests.
fa: شما نمی‌توانید بیشتر از {Profile.MAX_INTERESTS} علاقه‌مندی داشته باشید.

source: Image
fa: تصویر

source: Type
fa: نوع

source: Username
fa: نام کاربری

source: Interests
fa: علاقه‌مندی‌ها

source: Authentication
fa: احراز هویت

source: profile
fa: پروفایل

source: profiles
fa: پروفایل‌ها

source: Name
fa: نام

source: Slug
fa: نامک

source: Created at
fa: تاریخ ایجاد

source: Administration
fa: مدیریت

source: interest
fa: علاقه‌مندی

source: Host
fa: میزبان

source: Users
fa: کاربران

source: Otp code
fa: کد یکبار مصرف

source: Phone number
fa: شماره تلفن

source: Status
fa: وضعیت

source: Time Info
fa: اطلاعات زمانی

source: Expires at
fa: تاریخ انقضا

source: First name
fa: نام

source: Last name
fa: نام خانوادگی

source: Is active
fa: فعال

source: Is staff
fa: کارمند

source: Date joined
fa: تاریخ عضویت

source: Password
fa: رمز عبور

source: Password confirmation
fa: تأیید رمز عبور

source: Blacklisted at
fa: تاریخ لیست سیاه

source: Profile Information
fa: اطلاعات پروفایل

source: Social Networks
fa: شبکه‌های اجتماعی

source: No image uploaded
fa: تصویری آپلود نشده است

source: Image Preview
fa: پیش‌نمایش تصویر

source: Personal Info
fa: اطلاعات شخصی

source: Permissions
fa: دسترسی‌ها

source: Important dates
fa: تاریخ‌های مهم

source: Valid
fa: معتبر

source: Expired
fa: منقضی شده

source: Rate limited
fa: محدودیت درخواست

source: Expires in
fa: منقضی می‌شود در

source: Home
fa: خانه

source: Dashboard
fa: داشبورد

source: Action:
fa: عملیات:

source: Go
fa: اجرا

source: All
fa: همه

source: Any date
fa: هر تاریخی

source: Today
fa: امروز

source: Past 7 days
fa: ۷ روز گذشته

source: This month
fa: این ماه

source: This year
fa: امسال

source: No date
fa: بدون تاریخ

source: Has date
fa: دارای تاریخ

source: Yes
fa: بله

source: No
fa: خیر

source: Unknown
fa: نامشخص

source: Delete selected %(verbose_name_plural)s
fa: حذف %(verbose_name_plural)s های انتخاب شده

source: Search
fa: جستجو

source: Filter
fa: فیلتر

source: Clear all filters
fa: پاک کردن همه فیلترها

source: Save
fa: ذخیره

source: Save and add another
fa: ذخیره و افزودن مورد دیگر

source: Save and continue editing
fa: ذخیره و ادامه ویرایش

source: Save as new
fa: ذخیره به عنوان مورد جدید

source: Delete
fa: حذف

source: View on site
fa: مشاهده در سایت

source: Add
fa: افزودن

source: Change
fa: تغییر

source: Add %(name)s
fa: افزودن %(name)s

source: Change %(name)s
fa: تغییر %(name)s

source: Delete %(name)s
fa: حذف %(name)s

source: View %(name)s
fa: مشاهده %(name)s

source: Add another %(verbose_name)s
fa: افزودن %(verbose_name)s دیگر

source: Remove
fa: حذف

source: Successfully deleted %(count)d %(items)s.
fa: %(count)d %(items)s با موفقیت حذف شد.

source: Are you sure?
fa: آیا مطمئن هستید؟

source: No fields changed.
fa: هیچ فیلدی تغییر نکرده است.

source: Please correct the error below.
fa: لطفاً خطای زیر را اصلاح کنید.

source: %(counter)s result
fa: %(counter)s نتیجه

source: %(full_result_count)s total
fa: %(full_result_count)s مورد در مجموع

source: No results found
fa: نتیجه‌ای یافت نشد

source: 0 of %(cnt)s selected
fa: 0 از %(cnt)s انتخاب شده

source: All %(total_count)s selected
fa: همه %(total_count)s انتخاب شده

source: %(sel)s of %(cnt)s selected
fa: %(sel)s از %(cnt)s انتخاب شده

source: Select %(name)s
fa: انتخاب %(name)s

source: Select %(name)s to change
fa: %(name)s را برای تغییر انتخاب کنید

source: Select %(name)s to view
fa: %(name)s را برای مشاهده انتخاب کنید

source: Show all
fa: نمایش همه

source: By %(filter_title)s
fa: بر اساس %(filter_title)s

source: History
fa: تاریخچه

source: View history
fa: مشاهده تاریخچه

source: Log in
fa: ورود

source: Log out
fa: خروج

source: Site administration
fa: مدیریت سایت

source: Recent actions
fa: عملیات اخیر

source: My actions
fa: عملیات من

source: None available
fa: موردی موجود نیست

source: Change password
fa: تغییر رمز عبور

source: Database error
fa: خطای پایگاه داده

source: Date/time
fa: تاریخ/زمان

source: Action
fa: عملیات

source: Object
fa: شیء

source: User object
fa: شیء کاربر

source: Flag
fa: پرچم

source: Addition
fa: افزودن

source: Deletion
fa: حذف

source: LogEntry Object
fa: شیء ثبت وقایع

source: Added
fa: اضافه شد

source: Changed
fa: تغییر کرد

source: Deleted
fa: حذف شد

source: Added {name} "{object}".
fa: {name} «{object}» اضافه شد.

source: Changed {fields} for {name} "{object}".
fa: {fields} برای {name} «{object}» تغییر کرد.

source: Deleted {name} "{object}".
fa: {name} «{object}» حذف شد.

source: Changed {fields}.
fa: {fields} تغییر کرد.

source: and
fa: و

source: This object doesn't have a change history. It probably wasn't added via this admin site.
fa: این شیء تاریخچه تغییراتی ندارد. احتمالاً از طریق این سایت مدیریتی اضافه نشده است.

source: object id
fa: شناسه شیء

source: content type
fa: نوع محتوا

source: action time
fa: زمان عملیات

source: action flag
fa: پرچم عملیات

source: change message
fa: پیام تغییر

source: log entry
fa: ورودی ثبت وقایع

source: log entries
fa: ورودی‌های ثبت وقایع

source: Page %(number)s of %(num_pages)s
fa: صفحه %(number)s از %(num_pages)s

source: Show %(counter)s
fa: نمایش %(counter)s

source: Past %(days)s days
fa: %(days)s روز گذشته

source: Next %(days)s days
fa: %(days)s روز آینده

source: None
fa: هیچکدام

source: group
fa: گروه

source: groups
fa: گروه‌ها

source: permission
fa: مجوز

source: permissions
fa: مجوزها

source: user permission
fa: مجوز کاربر

source: user permissions
fa: مجوزهای کاربر

source: session
fa: نشست

source: sessions
fa: نشست‌ها

source: last login
fa: آخرین ورود

source: superuser status
fa: وضعیت ابرکاربر

source: staff status
fa: وضعیت کارمندی

source: active
fa: فعال

source: codename
fa: نام کد

source: description
fa: توضیحات

source: Required. 150 characters or fewer. Letters, digits and @/./+/-/_ only.
fa: الزامی. ۱۵۰ کاراکتر یا کمتر. فقط حروف، اعداد و @/./+/-/_

source: Designates whether the user can log into this admin site.
fa: مشخص می‌کند که آیا کاربر می‌تواند به این سایت مدیریتی وارد شود.

source: Designates whether this user should be treated as active. Unselect this instead of deleting accounts.
fa: مشخص می‌کند که آیا این کاربر باید فعال در نظر گرفته شود. به جای حذف حساب‌ها، این گزینه را غیرفعال کنید.

source: Designates that this user has all permissions without explicitly assigning them.
fa: مشخص می‌کند که این کاربر همه مجوزها را دارد بدون اینکه صریحاً به آن اختصاص داده شود.

source: The groups this user belongs to. A user will get all permissions granted to each of their groups.
fa: گروه‌هایی که این کاربر به آنها تعلق دارد. یک کاربر تمام مجوزهای اعطا شده به هر یک از گروه‌های خود را دریافت می‌کند.

source: Specific permissions for this user.
fa: مجوزهای خاص برای این کاربر.

source: This field is required.
fa: این فیلد الزامی است.

source: This field cannot be blank.
fa: این فیلد نمی‌تواند خالی باشد.

source: This field cannot be null.
fa: این فیلد نمی‌تواند تهی باشد.

source: Enter a valid value.
fa: یک مقدار معتبر وارد کنید.

source: Enter a valid email address.
fa: یک آدرس ایمیل معتبر وارد کنید.

source: Enter a valid URL.
fa: یک آدرس اینترنتی معتبر وارد کنید.

source: Enter a valid date.
fa: یک تاریخ معتبر وارد کنید.

source: Enter a valid time.
fa: یک زمان معتبر وارد کنید.

source: Enter a valid date/time.
fa: یک تاریخ/زمان معتبر وارد کنید.

source: The %(name)s "%(obj)s" was added successfully.
fa: %(name)s «%(obj)s» با موفقیت اضافه شد.

source: The %(name)s "%(obj)s" was changed successfully.
fa: %(name)s «%(obj)s» با موفقیت تغییر یافت.

source: The %(name)s "%(obj)s" was deleted successfully.
fa: %(name)s «%(obj)s» با موفقیت حذف شد.

source: You may edit it again below.
fa: می‌توانید دوباره آن را در زیر ویرایش کنید.

source: You may add another %(name)s below.
fa: می‌توانید %(name)s دیگری را در زیر اضافه کنید.
